; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	image1 - mode
	spectrograph0 - mode
	infrared2 - mode
	image3 - mode
	spectrograph4 - mode
	GroundStation8 - direction
	Star10 - direction
	GroundStation0 - direction
	Star2 - direction
	GroundStation11 - direction
	Star4 - direction
	GroundStation7 - direction
	Star6 - direction
	Star9 - direction
	Star5 - direction
	GroundStation3 - direction
	Star1 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 infrared2)
	(supports instrument0 image3)
	(calibration_target instrument0 Star9)
	(supports instrument1 spectrograph0)
	(supports instrument1 image1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument2 spectrograph0)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 GroundStation11)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star5)
	(supports instrument4 spectrograph4)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation11)
	(calibration_target instrument4 Star9)
	(calibration_target instrument4 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet18)
	(supports instrument5 spectrograph4)
	(supports instrument5 spectrograph0)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation3)
	(supports instrument6 image1)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 GroundStation7)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 GroundStation11)
	(supports instrument7 infrared2)
	(supports instrument7 spectrograph0)
	(supports instrument7 spectrograph4)
	(calibration_target instrument7 Star1)
	(calibration_target instrument7 GroundStation3)
	(calibration_target instrument7 Star5)
	(calibration_target instrument7 Star9)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon12)
)
(:goal (and
	(have_image Phenomenon12 image3)
	(have_image Star13 image3)
	(have_image Star14 spectrograph4)
	(have_image Planet15 image3)
	(have_image Phenomenon16 spectrograph4)
	(have_image Planet17 image3)
	(have_image Planet18 spectrograph0)
))

)

; plan
1. (turn_to satellite1 groundstation11 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 groundstation11)
   goals met: 0 of 7
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 7
3. (calibrate satellite1 instrument2 groundstation11)
   added: (calibrated instrument2)
   goals met: 0 of 7
4. (turn_to satellite1 planet18 groundstation11)
   deleted: (pointing satellite1 groundstation11)
   added: (pointing satellite1 planet18)
   goals met: 0 of 7
5. (take_image satellite1 planet18 instrument2 spectrograph0)
   added: (have_image planet18 spectrograph0)
   goals met: 1 of 7
6. (turn_to satellite1 phenomenon16 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 phenomenon16)
   goals met: 1 of 7
7. (turn_to satellite0 star9 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star9)
   goals met: 1 of 7
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
9. (calibrate satellite0 instrument0 star9)
   added: (calibrated instrument0)
   goals met: 1 of 7
10. (take_image satellite1 phenomenon16 instrument2 spectrograph4)
   added: (have_image phenomenon16 spectrograph4)
   goals met: 2 of 7
11. (turn_to satellite0 phenomenon12 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 7
12. (take_image satellite0 phenomenon12 instrument0 image3)
   added: (have_image phenomenon12 image3)
   goals met: 3 of 7
13. (turn_to satellite0 planet15 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet15)
   goals met: 3 of 7
14. (take_image satellite0 planet15 instrument0 image3)
   added: (have_image planet15 image3)
   goals met: 4 of 7
15. (turn_to satellite0 planet17 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet17)
   goals met: 4 of 7
16. (take_image satellite0 planet17 instrument0 image3)
   added: (have_image planet17 image3)
   goals met: 5 of 7
17. (turn_to satellite0 star13 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 star13)
   goals met: 5 of 7
18. (take_image satellite0 star13 instrument0 image3)
   added: (have_image star13 image3)
   goals met: 6 of 7
19. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 6 of 7
20. (take_image satellite0 star14 instrument0 spectrograph4)
   added: (have_image star14 spectrograph4)
   goals met: 7 of 7
